// Составьте алгоритм, определяющий по координатам вершин треугольника его вид: остроугольный, прямоугольный, тупоугольный

#include <stdio.h>
#include <locale.h>

int main() {
	int x1, y1, x2, y2, x3, y3, a, b, c;
	printf("Введите координаты 1-ой точки: ");
	scanf_s("%d %d", &x1, &y1);
	printf("Введите координаты 2-ой точки: ");
	scanf_s("%d %d", &x2, &y2);
	printf("Введите координаты 3-ей точки: ");
	scanf_s("%d %d", &x3, &y3);

	a = (x2 - x1) * (x2 - x1) + (y2 - y1) * (y2 - y1);
	b = (x3 - x1) * (x3 - x1) + (y3 - y1) * (y3 - y1);
	c = (x3 - x2) * (x3 - x2) + (y3 - y2) * (y3 - y2);

	if (a + b == c || b + c == a || a + c == b) {
		printf("Прямоугольный\n"); 
	}
	else if (a + b < c || a + c < b || b + c < a) {
		printf("Тупоугольный\n"); 
	}
	else {
		printf("Остроугольный\n"); 
	}
	return 0;
}
